
local _M = {
    -- input registers
    VER = {
      name = '版本',
    },
    XLW1 = {
      name = '初效压差开关'
    }, -- 初效压差开关
    XLW2 = {
      name = '高效压差开关'
    }, -- 高效压差开关
    FPR = {
      name = '室内风盘联动点'
    }, -- 室内风盘联动点
    FAR = {
      name = '送风风机运行状态'
    }, -- 送风风机  运行状态
    FAE = {
      name = '送风风机故障状态'
    },  -- 送风风机  故障状态
    EAR = {
      name = '排风风机运行状态'
    },  -- 排风风机  运行状态
    EAE = {
      name = '排风风机故障状态'
    },  -- 排风风机  故障状态
    RAT1 = {
      name = '室内回风温度'
    }, -- 室内回风温度
    RAH1 = {
      name = '室内回风湿度'
    }, -- 室内回风湿度
    FAT1 = {
      name = '新风温度(室外)'
    },  -- 新风温度（室外），**可能没有**
    FAH1 = {
      name = '新风湿度'
    },  -- 新风湿度
    SAT1 = {
      name = '送风温度'
    },  -- 送风温度，**可能没有**
    SAH1 = {
      name = '送风湿度'
    },  -- 送风湿度，**可能没有**
    DHT1 = {
      name = '新风机盘管温度'
    },  -- 新风机盘管温度/表冷器温度
    HWID = {
      name = 'dwk'
    },  -- dwk 是否存在标志
    HEALTH  = {
      name = '健康'
    },
    HEARTBEAT = {
      name = '心跳'
    },

    -- hold registers
    TEST = {
      name = 'test寄存器'
    },
    DWK = {
      name = '新风直膨主机',
    }, --新风直膨主机, **可能没有**
    JSK = {
      name = '加湿水阀'
    }, --加湿水阀
    DHV = {
      name = '冷水阀'
    }, --冷水阀
    FAV = {
      name = '新风风阀'
    }, --新风风阀
    FAK = {
      name = '送风风机启停'
    }, -- 送风风机  启停
    FAO = {
      name = '送风风机手动/自动'
    }, -- 送风风机  手动/自动， 意义不明确
    EAK = {
      name = '排风风机启停'
    }, -- 排风风机  启停
    EAO = {
      name = '排风风机手动/自动'
    }, -- 排风风机  手动/自动，意义不明确
    FAX = {
      name = '送风风机频率调节'
    }, -- 送风风机  频率调节
    EAX = {
      name = '排风风机频率调节'
    }, -- 排风风机  频率调节
    SYNC = {
      name = '同步'
    }
}


return _M
